app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "address", "city", "state", "zip", "certified_by", "experience", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 3]]
---
  def destroy
    @doctor.destroy