app/controllers/pets_controller.rb

INSERT INTO "pets" ("name", "breed", "age", "weight", "last_appointment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "elliot"], ["breed", "case"], ["age", 12], ["weight", 123], ["last_appointment", "02/2/2016"], ["created_at", "2016-03-02 08:25:05.457942"], ["updated_at", "2016-03-02 08:25:05.457942"]]
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save

DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 1]]
---
  def destroy
    @pet.destroy